src/cf/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыФормулБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыФормулБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклонениеПроцент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполнениеПроцент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среднее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Максимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минимум</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Округлить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Итог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазностьДат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыЭлементовФинансовогоОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЭлементовФинансовогоОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаголовокОтчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НередактируемыйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактируемыйТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МонетарныйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НемонетарныйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатьяБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеСтатьиБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказательБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеПоказателиБюджетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводныйПоказатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаПоказателиВСтроках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаПоказателиВКолонках</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаСложная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлементТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Колонки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Строки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаЯчеек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯчейкаТаблицы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Измерение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Группа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИтогПоГруппе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормулаПоГруппе</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыИзмеренийФинансовогоОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыИзмеренийФинансовогоОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валюта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмерениеРегистра</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмерениеРегистраБухгалтерии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Период</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Субконто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнаяАналитика</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/БюджетнаяОтчетностьКлиентСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция создает хранилище со стандартной структурой
// элемента бюджетного отчета на основании ссылки или строки
// вида бюджета
//
// Параметры:
//  Элемент  - ДанныеФормыСтрокаДерева или СправочникСсылка.ЭлементыФинансовыхОтчетов - помещаемое значение
//  АдресХранилища - УИД - УИД формы вида бюджета
//
// Возвращаемое значение:
//   Строка - Адрес в хранилище
//
Функция ПоместитьЭлементВХранилище(Элемент, АдресХранилища) Экспорт
	
	// Если формируем хранилище на основании строки - 
	// тогда формируем по элементу, если есть, иначе по самой строке
	Если ТипЗнч(Элемент) = Тип("ДанныеФормыЭлементДерева")
		ИЛИ ТипЗнч(Элемент) = Тип("ДанныеФормыЭлементКоллекции")
		ИЛИ ТипЗнч(Элемент) = Тип("СтрокаДереваЗначений") Тогда
		
		Если ЗначениеЗаполнено(Элемент.ЭлементОтчета) Тогда
			
			Возврат ФинансоваяОтчетностьВызовСервера.ПоместитьЭлементВХранилище(Элемент.ЭлементОтчета, АдресХранилища);
			
		Иначе
			
			СтруктураЭлемента = ФинансоваяОтчетностьКлиентСервер.СтруктураЭлементаОтчета();
			ЗаполнитьЗначенияСвойств(СтруктураЭлемента, Элемент);
			
			Если СтруктураЭлемента.ВидЭлемента = ВидЭлемента("СтатьяБюджетов")
				ИЛИ СтруктураЭлемента.ВидЭлемента = ВидЭлемента("ВсеСтатьиБюджетов") Тогда
				
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_СтатьяБюджетов", Элемент.СтатьяПоказательТипИзмерения);
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ВыводимыеПоказатели", Элемент.ВыводимыеПоказатели);
				
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ПериодичностьСмещения", ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_НижняяГраницаДанных", "[Начало периода данных]");
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ВерхняяГраницаДанных", "[Конец периода данных]");
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_НачалоПериодаГруппировки", "[Период группировки]");
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_КонецПериодаГруппировки", "[Период группировки]");
				
			ИначеЕсли СтруктураЭлемента.ВидЭлемента = ВидЭлемента("ПоказательБюджетов")
				ИЛИ СтруктураЭлемента.ВидЭлемента = ВидЭлемента("ВсеПоказателиБюджетов") Тогда
				
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ПоказательБюджетов", Элемент.СтатьяПоказательТипИзмерения);
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ВыводимыеПоказатели", Элемент.ВыводимыеПоказатели);
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ТипЗначенияПоказателя", Элемент.ТипЗначенияПоказателя);
				
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ПериодичностьСмещения", ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_НижняяГраницаДанных", "[Начало периода данных]");
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ВерхняяГраницаДанных", "[Конец периода данных]");
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_НачалоПериодаГруппировки", "[Период группировки]");
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_КонецПериодаГруппировки", "[Период группировки]");
				
			ИначеЕсли СтруктураЭлемента.ВидЭлемента = ВидЭлемента("Группа") Тогда
				
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ВыводитьЗаголовокЭлемента", Истина);
				
			ИначеЕсли СтруктураЭлемента.ВидЭлемента = ВидЭлемента("ФормулаПоГруппе") Тогда
				
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ФормулаПоГруппе", ПредопределенноеЗначение("Перечисление.ВидыФормулБюджетирования.Сумма"));
				
			ИначеЕсли СтруктураЭлемента.ВидЭлемента = ВидЭлемента("ПроизводныйПоказатель") Тогда
				
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_Формула", "");
				
			ИначеЕсли СтруктураЭлемента.ВидЭлемента = ВидЭлемента("Измерение") Тогда
				
				ТипИзмерения = ОпределитьТипИзмеренияПоТипуЗначения(Элемент.СтатьяПоказательТипИзмерения, Элемент);
				СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ТипИзмерения", 	ТипИзмерения);
				Если ТипИзмерения = ТипИзмерения("ИзмерениеРегистра") Тогда
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ИмяИзмерения", 	Элемент.СтатьяПоказательТипИзмерения);
				ИначеЕсли ТипИзмерения = ТипИзмерения("Период") Тогда
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_Периодичность", 	Элемент.СтатьяПоказательТипИзмерения);
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ЗначениеПериода", 	Элемент.ЗначениеАналитики);
				ИначеЕсли ТипИзмерения = ТипИзмерения("ФиксированнаяАналитика") Тогда
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ВидАналитики", 	Элемент.СтатьяПоказательТипИзмерения);
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ЭтоАналитикаПрочее", Элемент.ЭтоАналитикаПрочее);
				ИначеЕсли ТипИзмерения = ТипИзмерения("Аналитика") Тогда
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_ВидАналитики", 	Элемент.СтатьяПоказательТипИзмерения);
				ИначеЕсли ТипИзмерения = ТипИзмерения("Сценарий") Тогда
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_Сценарий", 		Элемент.СтатьяПоказательТипИзмерения);
				ИначеЕсли ТипИзмерения = ТипИзмерения("Валюта") Тогда
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_Валюта", 		Элемент.СтатьяПоказательТипИзмерения);
				ИначеЕсли ТипИзмерения = ТипИзмерения("Организация") Тогда
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_Организация", 	Элемент.СтатьяПоказательТипИзмерения);
				ИначеЕсли ТипИзмерения = ТипИзмерения("Подразделение") Тогда
					СтруктураЭлемента.Вставить("ДополнительныйРеквизит_Подразделение", 	Элемент.СтатьяПоказательТипИзмерения);
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат ФинансоваяОтчетностьВызовСервера.ПоместитьЭлементВХранилище(СтруктураЭлемента, АдресХранилища);
			
		КонецЕсли;
	Иначе
		Возврат ФинансоваяОтчетностьВызовСервера.ПоместитьЭлементВХранилище(Элемент, АдресХранилища);
	КонецЕсли;
	
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Функция определяет тип измерения бюджетного отчета
//
// Параметры:
//  Значение  - Произвольный - значение измерения бюджетного отчета
//                             на основании которого определяется тип измерения
//  ДополнительныеПараметры  - Структура - дополнительные сведения
//
// Возвращаемое значение:
//   ПеречислениеСсылка.ТипыИзмеренийБюджетныхОтчетов - тип измерения
//
Функция ОпределитьТипИзмеренияПоТипуЗначения(Значение, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ТипЗнч(Значение) = Тип("ПеречислениеСсылка.Периодичность") Тогда
		
		Возврат ТипИзмерения("Период");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("ПланВидовХарактеристикСсылка.АналитикиСтатейБюджетов") Тогда
		
		Если ДополнительныеПараметры <> Неопределено
			И (ЗначениеЗаполнено(ДополнительныеПараметры.ЗначениеАналитики) 
			ИЛИ ДополнительныеПараметры.ЭтоАналитикаПрочее) Тогда
			Возврат ТипИзмерения("ФиксированнаяАналитика");
		Иначе
			Возврат ТипИзмерения("Аналитика");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Сценарии") Тогда
		
		Возврат ТипИзмерения("Сценарий");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Организации") Тогда
		
		Возврат ТипИзмерения("Организация");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.ПодразделенияОрганизаций") Тогда
		
		Возврат ТипИзмерения("Подразделение");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.Валюты") Тогда
		
		Возврат ТипИзмерения("Валюта");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				
		Возврат ТипИзмерения("ЕдиницаИзмерения");
		
	ИначеЕсли ТипЗнч(Значение) = Тип("Строка") Тогда
		
		Возврат ТипИзмерения("ИзмерениеРегистра");
		
	Иначе
		
		ТекстНСТР = НСтр("en='Unknown dimension type budget report';ru='Неизвестный тип измерения бюджетного отчета'");
		ВызватьИсключение ТекстНСТР;
		
	КонецЕсли;
	
КонецФункции

// Процедура заполняет строку списка или дерева элементов отчета
// дополнительными реквизитами
//
// Параметры:
//  Результат - структура - источник заполнения
//  СтрокаПриемник - ДанныеФормыСтрокаДерева - строка, которую заполняем
//  АдресЭлементаВХранилище - строка - адрес хранилища элемента
//  Поле - ДанныеФормыКоллекция - для поиска строки, если приемник - идентификатор строки
//
Процедура ЗаполнитьСтрокуСпискаЭлементовОтчета(Знач Результат, Знач СтрокаПриемник, АдресЭлементаВХранилище = Неопределено, Поле = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Форма возвращает актуальные реквизиты
	Если ТипЗнч(СтрокаПриемник) = Тип("Число") Тогда
		СтрокаПриемник = Поле.НайтиПоИдентификатору(СтрокаПриемник);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаПриемник, Результат);
	ДополнительныеРеквизитыСписка = "ВыводимыеПоказатели, ТипЗначенияПоказателя, ВыводитьЗаголовокЭлемента";
	Если Не ЗначениеЗаполнено(АдресЭлементаВХранилище) Тогда
		ДополнительныеРеквизиты = 
				ФинансоваяОтчетностьВызовСервера.ЗначенияДополнительныхРеквизитов(
													Результат,
													ДополнительныеРеквизитыСписка);
	Иначе
		// Но актуальные значения дополнительных реквизитов формируются на сервере
		// в ПередЗаписьюНаСервере, соответственно находятся в хранилище
		ДополнительныеРеквизиты = 
				ФинансоваяОтчетностьВызовСервера.ЗначенияДополнительныхРеквизитов(
													АдресЭлементаВХранилище,
													ДополнительныеРеквизитыСписка);
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтрокаПриемник, ДополнительныеРеквизиты);
	
КонецПроцедуры

// Функция возвращает представление смещения
//
// Параметры:
//  Период  - Число - количество периодов смещения
//  Периодичность  - ПеречислениеСсылка.Периодичность - периодичность смещения
//
// Возвращаемое значение:
//   Строка   - представление смещения
//
Функция ПредставлениеСмещения(Форма, ЗначениеПустое = Ложь) Экспорт
	
	ЗначениеПустое = Ложь;
	
	Периодичность = Форма.ПериодичностьСмещения;
	Период = Форма.ПериодСмещения;
	
	Если Период = 0 Тогда
		ПредставлениеПериод = "";
	Иначе
		ТекстНСТР = НСтр("en='Data offset at %1 back';ru='Данные смещены на %1 назад'");
		ПредставлениеПериод = БюджетированиеКлиентСервер.ПериодЦифрамиПериодичностьПрописью(Период, Периодичность);
		ПредставлениеПериод = СтрШаблон(ТекстНСТР, ПредставлениеПериод);
	КонецЕсли;
	
	ЕстьИзмененияГраниц = Ложь;
	
	Если ЗначениеЗаполнено(Форма.НижняяГраницаДанных)
		И Форма.НижняяГраницаДанных <> "[Начало периода данных]" Тогда
		
		ЕстьИзмененияГраниц = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Форма.ВерхняяГраницаДанных)
		И Форма.ВерхняяГраницаДанных <> "[Конец периода данных]" Тогда
		
		ЕстьИзмененияГраниц = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Форма.НачалоПериодаГруппировки)
		И Форма.НачалоПериодаГруппировки <> "[Период группировки]" Тогда
		
		ЕстьИзмененияГраниц = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(Форма.КонецПериодаГруппировки)
		И Форма.КонецПериодаГруппировки <> "[Период группировки]" Тогда
		
		ЕстьИзмененияГраниц = Истина;
		
	КонецЕсли;
	
	ПредставлениеГраниц = "";
	Если ЕстьИзмененияГраниц Тогда
		ПредставлениеГраниц = НСтр("en='The boundaries of the period are set';ru='Установлены границы периода'");
	КонецЕсли;
	
	Если ПредставлениеГраниц = ""
		И ПредставлениеПериод = "" Тогда
		
		Результат = НСтр("en='Offset and data boundary is not set';ru='Смещение и границы данных не заданы'");
		ЗначениеПустое = Истина;
		
	ИначеЕсли ПредставлениеПериод <> ""
		И ПредставлениеГраниц <> "" Тогда
		
		Результат = ПредставлениеПериод + ", " + НРег(ПредставлениеГраниц);
		
	ИначеЕсли ПредставлениеПериод <> "" Тогда
		
		Результат = ПредставлениеПериод;
		
	ИначеЕсли ПредставлениеГраниц <> "" Тогда
		
		Результат = ПредставлениеГраниц;
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Функция возвращает цвет стиля
//
// Параметры:
//  ЛокальныйКэш  - Соответствие - локальный кэш для хранения соответствия имен
//                                 и цветов, что бы не обращаться к серверу в случае
//                                 клиентского вызова
//  ИмяЦвета  - Строка - имя цвета
//
// Возвращаемое значение:
//   Цвет   - Цвет стиля по имени
//
Функция ПолучитьЦветСтиля(ЛокальныйКэш, ИмяЦвета) Экспорт
	Перем Цвет;
	
	Если ЛокальныйКэш = Неопределено Тогда
		ЛокальныйКэш = Новый Структура;
	КонецЕсли;
	
	Если ЛокальныйКэш.Свойство(ИмяЦвета, Цвет) Тогда
		Возврат Цвет;
	КонецЕсли;
	
	Цвет = БюджетнаяОтчетностьВызовСервера.ПолучитьЦвет(ИмяЦвета);
	ЛокальныйКэш.Вставить(ИмяЦвета, Цвет);
	
	Возврат Цвет;
	
КонецФункции

Функция ВидЭлемента(ИмяВидаЭлемента)
	
	Возврат ПредопределенноеЗначение("Перечисление.ВидыЭлементовФинансовогоОтчета."+ИмяВидаЭлемента);
	
КонецФункции

Функция ТипИзмерения(ИмяВидаЭлемента)
	
	Возврат ПредопределенноеЗначение("Перечисление.ТипыИзмеренийФинансовогоОтчета."+ИмяВидаЭлемента);
	
КонецФункции

Функция ЛеваяЧастьИмениСовпадает(Имя, ИскомаяСтрока) Экспорт
	
	Возврат Лев(Имя, СтрДлина(ИскомаяСтрока)) = ИскомаяСтрока;
	
КонецФункции

Функция ПараметрыОткрытияФормыНастройкиПериода(Форма, ДополнятьЭлементамиОтчета = Истина) Экспорт
	
	ЗаполняемыеПоля = "ПериодСмещения, ПериодичностьСмещения, НижняяГраницаДанных,
						|ВерхняяГраницаДанных, НачалоПериодаГруппировки, КонецПериодаГруппировки" + 
						?(ДополнятьЭлементамиОтчета, "
						|, АдресТаблицыЭлементов, АдресРедактируемогоЭлемента
						|, АдресЭлементовОтчета, ВариантРасположенияГраницыФактическихДанных", "");
	
	Параметры = Новый Структура(ЗаполняемыеПоля);
	ЗаполнитьЗначенияСвойств(Параметры, Форма);
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыОткрытияФормыНастройкиПериодичностиПланирования(ФормаОбъект) Экспорт
	
	ЗаполняемыеПоля = "Периодичность, СпособПланирования, ВариантРасположенияГраницыФактическихДанных,
						|КоличествоПериодовСкользящегоБюджета, СмещениеГраницыФакта, ПериодичностьГраницыФакта";
	
	Параметры = Новый Структура(ЗаполняемыеПоля);
	ЗаполнитьЗначенияСвойств(Параметры, ФормаОбъект);
	
	Возврат Параметры;
	
КонецФункции

// Определяет, является ли переданное поле полем, содержащим период
//
// Параметры:
//    Имя - Строка - Имя поля
//
// Возвращаемое значение:
//    Булево - Признак того, что поле является полем, содержащим период
//
Функция ЭтоПолеПериода(Имя) Экспорт
	
	ПоляПериода = Новый Массив;
	ПоляПериода.Добавить("Период");
	ПоляПериода.Добавить("ПериодДень");
	ПоляПериода.Добавить("ПериодНеделя");
	ПоляПериода.Добавить("ПериодДекада");
	ПоляПериода.Добавить("ПериодМесяц");
	ПоляПериода.Добавить("ПериодКвартал");
	ПоляПериода.Добавить("ПериодПолугодие");
	ПоляПериода.Добавить("ПериодГод");
	
	Возврат ПоляПериода.Найти(Имя) <> Неопределено;
	
КонецФункции

Функция УпорядоченныеПериодичности() Экспорт
	
	Периодичности = Новый Массив;
	
	Периодичности.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.ПустаяСсылка"));
	Периодичности.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.День"));
	Периодичности.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Неделя"));
	Периодичности.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Декада"));
	Периодичности.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	Периодичности.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Квартал"));
	Периодичности.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Полугодие"));
	Периодичности.Добавить(ПредопределенноеЗначение("Перечисление.Периодичность.Год"));
	
	Возврат Периодичности;
	
КонецФункции

// Возвращает минимальную периодичность из переданных
//
// Параметры:
// 	Периодичности - Массив - Периодичности, из которых надо найти минимальную.
// 
// Возвращаемое значение:
// 	ПеречислениеСсылка.Периодичность - Найденная минимальная периодичность.
//
Функция МинимальнаяПериодичность(Периодичности) Экспорт
	
	Результат = Неопределено;
	
	УпорядоченныеПериодичности = УпорядоченныеПериодичности();
	Для каждого Периодичность Из УпорядоченныеПериодичности Цикл 
		Если ЗначениеЗаполнено(Периодичность) И Периодичности.Найти(Периодичность) <> Неопределено Тогда
			Результат = Периодичность;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции


#Область ЭкземплярБюджета

Функция МаксимальныйНомерПоПорядку(Объект) Экспорт
	
	МаксимальныйНомер = 0;
	Для Каждого СтрокаОборотов Из Объект.ОборотыПоСтатьямБюджетов Цикл
		МаксимальныйНомер = Макс(СтрокаОборотов.НомерПоПорядку, МаксимальныйНомер);
	КонецЦикла;
	
	Возврат МаксимальныйНомер;
	
КонецФункции

Функция ИдентификаторАналитикиСтатейБюджетов(ОбъектИПараметрыРасчета, ДанныеПоиска, Добавлять = Истина) Экспорт
	Перем ИдентификаторСтроки;
	
	Объект = ОбъектИПараметрыРасчета.Объект;
	ВалютаСценария = ОбъектИПараметрыРасчета.ВалютаСценария;
	
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	СтруктураПоиска = Новый Структура;
	Для НомерАналитики = 1 По МаксимальноеКоличествоАналитик Цикл
		СтруктураПоиска.Вставить("Аналитика" + НомерАналитики);
	КонецЦикла;
	
	Если ДанныеПоиска.Свойство("СтатьяБюджетов") Тогда
		СтруктураПоиска.Вставить("СтатьяБюджетов");
		СтруктураПоиска.Вставить("Валюта");
		ИмяТабличнойЧасти = "АналитикаСтатейБюджетов";
	Иначе
		СтруктураПоиска.Вставить("РедактируемоеЗначение");
		Для Сч = 1 По МаксимальноеКоличествоАналитик Цикл
			СтруктураПоиска.Вставить("ВидАналитики" + Сч);
		КонецЦикла;
		ИмяТабличнойЧасти = "АналитикаЗначений";
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ДанныеПоиска);
	
	Если ДанныеПоиска.Свойство("СтатьяБюджетов") Тогда
		Если ТипЗнч(ДанныеПоиска) = Тип("Структура") Тогда
			Если ДанныеПоиска.Свойство("Валюта") Тогда
				Если ДанныеПоиска.Валюта = Неопределено Тогда
					СтруктураПоиска.Удалить("Валюта");
				Иначе
					СтруктураПоиска.Валюта = ДанныеПоиска.Валюта;
				КонецЕсли;
			Иначе
				СтруктураПоиска.Валюта = ВалютаСценария;
			КонецЕсли;
		Иначе
			СтруктураПоиска.Валюта = ВалютаСценария;
		КонецЕсли;
	Иначе
		МаксимальныйНомерАналитики = 0;
		Для Сч = 1 По МаксимальноеКоличествоАналитик Цикл
			Если ЗначениеЗаполнено(СтруктураПоиска["ВидАналитики" + Сч]) Тогда
				МаксимальныйНомерАналитики = Сч;
			КонецЕсли;
		КонецЦикла;
		СтруктураПоиска.Вставить("КоличествоИспользуемыхАналитик", МаксимальныйНомерАналитики);
	КонецЕсли;
	
	РезультатПоиска = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
	Если РезультатПоиска.Количество() = 0 Тогда
		Если Добавлять Тогда
			СтрокаАналитикиСтатейБюджетов = Объект[ИмяТабличнойЧасти].Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаАналитикиСтатейБюджетов, СтруктураПоиска);
			СтрокаАналитикиСтатейБюджетов.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			ИдентификаторСтроки = СтрокаАналитикиСтатейБюджетов.ИдентификаторСтроки;
		КонецЕсли;
	Иначе
		ИдентификаторСтроки = РезультатПоиска[0].ИдентификаторСтроки;
	КонецЕсли;
	
	Возврат ИдентификаторСтроки;
	
КонецФункции


// Преобразование расшифровки
// 
// Параметры:
// 	ОбъектИПараметрыРасчета - см. БюджетнаяОтчетностьКлиентСервер.СтруктураОбъектаДляРасчетаЯчейки
// 	Расшифровка - Соответствие, Неопределено - Описание
// 	РежимПоиска - Булево - Описание
// 	ИмяПоказателя - Неопределено, Строка - Описание
// Возвращаемое значение:
// 	Неопределено, Структура - 
Функция ПреобразоватьРасшифровку(ОбъектИПараметрыРасчета, Расшифровка, РежимПоиска = Ложь, ИмяПоказателя = Неопределено) Экспорт
	Перем СтатьяБюджетов, СтруктураРезультат;
	
	КэшПараметровСтатей = ОбъектИПараметрыРасчета.КэшПараметровСтатей;
	Объект = ОбъектИПараметрыРасчета.Объект;
	
	Если Расшифровка.Свойство("СтатьяБюджетов", СтатьяБюджетов)
		И ЗначениеЗаполнено(СтатьяБюджетов) Тогда
		СтруктураРезультат = Новый Структура("СтатьяБюджетов", СтатьяБюджетов);
	ИначеЕсли Расшифровка.Свойство("ПоказательБюджетов", СтатьяБюджетов)
		И ЗначениеЗаполнено(СтатьяБюджетов) Тогда
		СтруктураРезультат = Новый Структура("ПоказательБюджетов", СтатьяБюджетов);
	ИначеЕсли Расшифровка.Свойство("РедактируемоеЗначение", СтатьяБюджетов)
		И ЗначениеЗаполнено(СтатьяБюджетов) Тогда
		СтруктураРезультат = Новый Структура("РедактируемоеЗначение", СтатьяБюджетов);
	КонецЕсли;
	
	Если СтруктураРезультат = Неопределено Тогда
		Если Не РежимПоиска Тогда
			ВызватьИсключение НСтр("ru = 'Ошибка в структуре вида бюджета: не определен тип ячейки значения';
									|en = 'Error in the budget profile structure: value cell type is not determined'");
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ИспользуемыеПериоды = Новый Массив;
	Для Каждого КлючИЗначение Из Расшифровка Цикл
		Если ЭтоПолеПериода(КлючИЗначение.Ключ) Тогда
			Периодичность = ФинансоваяОтчетностьКлиентСервер.ПериодичностьПоПериодуСтрокой(КлючИЗначение.Ключ);
			Если ЗначениеЗаполнено(Периодичность) Тогда
				ИспользуемыеПериоды.Добавить(Периодичность);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ИспользуемыеПериоды.Количество() Тогда
		МинимальнаяПериодичность = МинимальнаяПериодичность(ИспользуемыеПериоды);
		КолонкаПериод = ФинансоваяОтчетностьКлиентСервер.СтрокиПериода(МинимальнаяПериодичность).Период;
		СтруктураРезультат.Вставить("ПериодПланирования", Расшифровка[КолонкаПериод]);
	Иначе
		СтруктураРезультат.Вставить("ПериодПланирования", Объект.НачалоПериода);
	КонецЕсли;
	
	ПоказательРасшифровки = Неопределено;
	Если Расшифровка.Свойство("ИмяПоказателя", ПоказательРасшифровки) Тогда
		ИмяПоказателя = ПоказательРасшифровки;
	Иначе
		ИмяПоказателя = "Сумма";
	КонецЕсли;
	
	Валюта = Неопределено;
	Если Расшифровка.Свойство("Валюта", Валюта) Тогда
		СтруктураРезультат.Вставить("Валюта", Валюта);
	КонецЕсли;
	
	МаксимальноеКоличествоАналитик = БюджетированиеКлиентСервер.МаксимальноеКоличествоАналитик();
	ПустоеЗначениеАналитики = БюджетированиеКлиентСервер.ПустоеЗначениеАналитики();
	Если СтруктураРезультат.Свойство("СтатьяБюджетов") И КэшПараметровСтатей[СтатьяБюджетов] <> Неопределено Тогда
		
		РеквизитыСтатьи = КэшПараметровСтатей[СтатьяБюджетов];
		
		Для Сч = 1 По МаксимальноеКоличествоАналитик Цикл
			
			ВидАналитики = РеквизитыСтатьи["ВидАналитики" + Сч];
			ТипВидаАналитики = РеквизитыСтатьи["ВидАналитики" + Сч + "ТипЗначения"];
			ЗначениеАналитики = ПустоеЗначениеАналитики;
			Если ЗначениеЗаполнено(ВидАналитики) Тогда
				ЗначениеАналитики = Расшифровка.ЗначенияАналитик[ВидАналитики];
				Если ТипЗнч(ЗначениеАналитики) = Тип("Строка") Тогда
					ЗначениеАналитики = ПустоеЗначениеАналитики;
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(ТипВидаАналитики) Тогда
				ЗначениеАналитики = БюджетированиеКлиентСервер.ПриведенноеЗначениеАналитики(ЗначениеАналитики, ТипВидаАналитики);
			КонецЕсли;
			СтруктураРезультат.Вставить("Аналитика" + Сч, ЗначениеАналитики);
			
		КонецЦикла;
		
	Иначе
		
		СвойстваАналитикОтчета = БюджетнаяОтчетностьВызовСервера.СвойстваАналитикОтчета(ОбъектИПараметрыРасчета.ПараметрыВыводаВидаБюджета);
		ЗначенияТипов = СвойстваАналитикОтчета.ЗначенияТипов;
		ВидыАналитикОтчета = СвойстваАналитикОтчета.ВидыАналитикОтчета;
		
		Для СчетчикДополнения = 1 По МаксимальноеКоличествоАналитик Цикл
			ПустаяСсылкаНаАналитику = ПредопределенноеЗначение("ПланВидовХарактеристик.АналитикиСтатейБюджетов.ПустаяСсылка");
			СтруктураРезультат.Вставить("ВидАналитики" + СчетчикДополнения, ПустаяСсылкаНаАналитику);
			СтруктураРезультат.Вставить("Аналитика" + СчетчикДополнения, ПустоеЗначениеАналитики);
		КонецЦикла;
		
		
		// Получаем значения видов аналитики из расшифровки, упорядочиваем коллекцию по номеру аналитики в отчете в целом.
		НомераВидовАналитик = Новый СписокЗначений;
		АналитикаРасшифровкиПоНомеруВОтчете = Новый Соответствие;
		//Для Каждого КлючИЗначение Из Расшифровка.ЗначенияАналитик Цикл
		//	ВидАналитики           = КлючИЗначение.Ключ;
		//	ИндексАналитикиВОтчете = ВидыАналитикОтчета.Найти(ВидАналитики);
		//	Если ИндексАналитикиВОтчете = Неопределено Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	НомерАналитикиВОтчете = ИндексАналитикиВОтчете + 1;
		//	ЗначениеАналитики     = КлючИЗначение.Значение;
		//	НомераВидовАналитик.Добавить(НомерАналитикиВОтчете);
		//	АналитикаРасшифровкиПоНомеруВОтчете.Вставить(НомерАналитикиВОтчете,
		//		Новый Структура("ВидАналитики, ЗначениеАналитики", ВидАналитики, ЗначениеАналитики));
		//КонецЦикла;
		//НомераВидовАналитик.СортироватьПоЗначению(НаправлениеСортировки.Возр);
		
		// Номера видов аналитики задаем в с 1 для данной статьи / показателя, но в порядке, соответствующему общему порядку
		// аналитики в отчете.
		Сч = 1;
		Для Каждого ЭлементСписка Из НомераВидовАналитик Цикл
			
			НомерАналитикиВОтчете = ЭлементСписка.Значение;
			ВидАналитики = АналитикаРасшифровкиПоНомеруВОтчете.Получить(НомерАналитикиВОтчете).ВидАналитики;
			ЗначениеАналитики = ПустоеЗначениеАналитики;
			Если ЗначениеЗаполнено(ВидАналитики) Тогда
				ЗначениеАналитики = АналитикаРасшифровкиПоНомеруВОтчете.Получить(НомерАналитикиВОтчете).ЗначениеАналитики;
				Если ТипЗнч(ЗначениеАналитики) = Тип("Строка") Тогда
					ЗначениеАналитики = ПустоеЗначениеАналитики;
				КонецЕсли;
			КонецЕсли;
			
			ТипЗначенияАналитики = ЗначенияТипов[ВидАналитики].ТипЗначения;
			ЗначениеАналитики = БюджетированиеКлиентСервер.ПриведенноеЗначениеАналитики(ЗначениеАналитики, ТипЗначенияАналитики);
			СтруктураРезультат.Вставить("Аналитика" + Сч, ЗначениеАналитики);
			СтруктураРезультат.Вставить("ВидАналитики" + Сч, ВидАналитики);
			Сч = Сч + 1;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СтруктураРезультат;
	
КонецФункции


// Описание
// 
// Параметры:
// 	ОбъектИПараметрыРасчета - см. БюджетнаяОтчетностьКлиентСервер.СтруктураОбъектаДляРасчетаЯчейки
// 	Расшифровка - Соответствие, Неопределено -
// 	ИмяПоказателя - Строка, Неопределено -
// 	РасшифровкаАналитика - Структура, Неопределено -
// 	ТолькоНайти - Булево - Описание
// Возвращаемое значение:
// 	ДанныеФормыЭлементКоллекции - строка табличной части "ОборотыПоСтатьямБюджетов". Содержит в том числе:
// 		* Примечание - Строка -
//
Функция НайтиСтрокуОборотаПоРасшифровке(ОбъектИПараметрыРасчета, Расшифровка, ИмяПоказателя = Неопределено, 
											РасшифровкаАналитика = Неопределено, ТолькоНайти = Ложь) Экспорт
	
	Объект = ОбъектИПараметрыРасчета.Объект;
	РасшифровкаАналитика = ПреобразоватьРасшифровку(ОбъектИПараметрыРасчета, Расшифровка, , ИмяПоказателя);
	ПериодПланирования   = РасшифровкаАналитика.ПериодПланирования;
	
	ИдентификаторСтроки  = ИдентификаторАналитикиСтатейБюджетов(ОбъектИПараметрыРасчета, РасшифровкаАналитика);
	
	Отбор = Новый Структура();
	Отбор.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	Отбор.Вставить("ПериодПланирования", ПериодПланирования);
	РезультатПоиска = Объект.ОборотыПоСтатьямБюджетов.НайтиСтроки(Отбор);
	
	Если РезультатПоиска.Количество() = 0 Тогда
		
		Если ТолькоНайти Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		СтрокаОборот = Объект.ОборотыПоСтатьямБюджетов.Добавить(); // ДанныеФормыЭлементКоллекции
		ЗаполнитьЗначенияСвойств(СтрокаОборот, Отбор);
		Если ОбъектИПараметрыРасчета.Свойство("МаксимальныйНомерПоПорядку") Тогда
			МаксимальныйНомер = ОбъектИПараметрыРасчета.МаксимальныйНомерПоПорядку;
		ИначеЕсли ОбъектИПараметрыРасчета.Свойство("ТекущийНомерПоПорядку")
			И ЗначениеЗаполнено(ОбъектИПараметрыРасчета.ТекущийНомерПоПорядку) Тогда
			МаксимальныйНомер = ОбъектИПараметрыРасчета.ТекущийНомерПоПорядку;
		Иначе
			МаксимальныйНомер = МаксимальныйНомерПоПорядку(Объект);
		КонецЕсли;
		СтрокаОборот.НомерПоПорядку = МаксимальныйНомер + 1;
		Если ОбъектИПараметрыРасчета.Свойство("МаксимальныйНомерПоПорядку") Тогда
			ОбъектИПараметрыРасчета.МаксимальныйНомерПоПорядку = СтрокаОборот.НомерПоПорядку;
		ИначеЕсли ОбъектИПараметрыРасчета.Свойство("ТекущийНомерПоПорядку") Тогда
			ОбъектИПараметрыРасчета.ТекущийНомерПоПорядку = СтрокаОборот.НомерПоПорядку;
		КонецЕсли;
		
	Иначе
		
		СтрокаОборот = РезультатПоиска[0]; // ДанныеФормыЭлементКоллекции
		
	КонецЕсли;
	
	Возврат СтрокаОборот;
	
КонецФункции


// Описание
// 
// Параметры:
// 	ОбъектИПараметрыРасчета - см. БюджетнаяОтчетностьКлиентСервер.СтруктураОбъектаДляРасчетаЯчейки
// 	Расшифровка - см. БюджетнаяОтчетностьВызовСервера.ЗначениеРасшифровки
// 	ТекстЗначения - Строка -
// 	Примечание - Строка, Неопределено -
// 	РежимЗаполнения - Булево -
// Возвращаемое значение:
// 	Структура - Описание:
// * Примечание - Строка, Неопределено -
// * Сумма - Число -
// * СуммаВВалюте - Число -
// * Количество - Число -
// * Значение - Число -
//
Функция ОтразитьИзменениеЯчейки(ОбъектИПараметрыРасчета, Расшифровка, ТекстЗначения, Примечание = Неопределено, РежимЗаполнения = Ложь) Экспорт
	Перем ИмяПоказателя, РасшифровкаАналитика;
	
	Объект = ОбъектИПараметрыРасчета.Объект;
	ВалютаСценария = ОбъектИПараметрыРасчета.ВалютаСценария;
	
	СтрокаОборот = НайтиСтрокуОборотаПоРасшифровке(ОбъектИПараметрыРасчета, Расшифровка, ИмяПоказателя, РасшифровкаАналитика);
	Если РасшифровкаАналитика.Свойство("ПоказательБюджетов")
		И ЗначениеЗаполнено(РасшифровкаАналитика.ПоказательБюджетов) Тогда
		// Расчетные показатели бюджетов рассчитываются автоматически и не редактируются
		ТекстЗначения = 0;
	КонецЕсли;
	Если ТипЗнч(ТекстЗначения) = Тип("Число") Тогда
		Значение = ТекстЗначения;
	ИначеЕсли ИмяПоказателя = "Значение" Тогда
		Значение = ТекстЗначения;
	ИначеЕсли ТекстЗначения = "#Знач" Тогда
		Значение = 0;
	Иначе
		Попытка
			ЗначениеСтрокой = СтрЗаменить(ТекстЗначения, Символы.НПП, "");
			ЗначениеСтрокой = СтрЗаменить(ТекстЗначения, " ", "");
			Если Лев(ЗначениеСтрокой, 1) = "("
			   И Прав(ЗначениеСтрокой, 1) = ")" Тогда
				ЗначениеСтрокой = Сред(ЗначениеСтрокой, 2, СтрДлина(ЗначениеСтрокой) - 2);
				Значение = -Число(ЗначениеСтрокой);
			Иначе
				Значение = Число(ЗначениеСтрокой);
			КонецЕсли;
		Исключение
			Значение = 0;
		КонецПопытки;
	КонецЕсли;
	
	ПериодПланирования = РасшифровкаАналитика.ПериодПланирования;
	
	Если Примечание <> Неопределено Тогда
		СтрокаОборот.Примечание = Примечание;
	КонецЕсли;
	
	Если ИмяПоказателя = "Сумма" Тогда
		
		Валюта = Неопределено;
		Если РасшифровкаАналитика.Свойство("Валюта", Валюта) И Валюта <> ВалютаСценария Тогда
			
			СтрокаОборот.Сумма = БюджетнаяОтчетностьВызовСервера.ПересчитатьПоТаблицеКурсов(ОбъектИПараметрыРасчета,
				Значение,
				ПериодПланирования,
				Валюта,
				ВалютаСценария);
			СтрокаОборот.СуммаВВалюте = Значение;
			
		Иначе
			
			СтрокаОборот.Сумма = Значение;
			СтрокаОборот.СуммаВВалюте = Значение;
			
		КонецЕсли;
		
	Иначе
		
		СтрокаОборот[ИмяПоказателя] = Значение;
		
	КонецЕсли;
	
	Результат = Новый Структура();
	Результат.Вставить("Сумма", СтрокаОборот.Сумма);
	Результат.Вставить("СуммаВВалюте", СтрокаОборот.СуммаВВалюте);
	Результат.Вставить("Количество", СтрокаОборот.Количество);
	//Результат.Вставить("Значение", СтрокаОборот.Значение);
	Если НЕ Примечание = Неопределено Тогда
		Результат.Вставить("Примечание", Примечание);
	КонецЕсли;
	
	//Если Не РежимЗаполнения Тогда
	//	Если СтрокаОборот.Сумма = 0 И СтрокаОборот.СуммаВВалюте = 0
	//		И СтрокаОборот.Количество = 0
	//		И Не ЗначениеЗаполнено(СтрокаОборот.Значение)
	//		И ПустаяСтрока(СтрокаОборот.Примечание) Тогда
	//		
	//		Объект.ОборотыПоСтатьямБюджетов.Удалить(СтрокаОборот);
	//		ИдентификаторСтроки = ИдентификаторАналитикиСтатейБюджетов(ОбъектИПараметрыРасчета, РасшифровкаАналитика);
	//		
	//		Отбор = Новый Структура();
	//		Отбор.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
	//		РезультатПоиска = Объект.ОборотыПоСтатьямБюджетов.НайтиСтроки(Отбор);
	//		Если Не РезультатПоиска.Количество() Тогда
	//			НайденнаяСтрока = Объект.АналитикаСтатейБюджетов.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	//			Если НайденнаяСтрока.Количество() Тогда
	//				Объект.АналитикаСтатейБюджетов.Удалить(НайденнаяСтрока[0]);
	//			КонецЕсли;
	//			НайденнаяСтрока = Объект.АналитикаЗначений.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
	//			Если НайденнаяСтрока.Количество() Тогда
	//				Объект.АналитикаЗначений.Удалить(НайденнаяСтрока[0]);
	//			КонецЕсли;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


// Конструктор структуры объекта для расчета ячейки
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * АдресДанныхРасшифровки - Строка, Неопределено -
// * ПараметрыВыводаВидаБюджета - Строка, Неопределено -
// * АдресТаблицыКурсов - Строка, Неопределено -
// * ТребоватьУказанияКурсовДляКаждогоПериода - Булево -
// * КэшПараметровСтатей - См. БюджетированиеСервер.ЗаполнитьКэшПараметровСтатей
// * ВалютаСценария - СправочникСсылка.Валюты, Неопределено -  
// * Объект - ДанныеФормыСтруктура, Неопределено -
Функция СтруктураОбъектаДляРасчетаЯчейки() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Объект");
	Результат.Вставить("ВалютаСценария");
	Результат.Вставить("КэшПараметровСтатей");
	Результат.Вставить("ТребоватьУказанияКурсовДляКаждогоПериода");
	Результат.Вставить("АдресТаблицыКурсов");
	Результат.Вставить("ПараметрыВыводаВидаБюджета");
	Результат.Вставить("АдресДанныхРасшифровки");
	
	Возврат Результат;
	
КонецФункции


// Возвращает структуру объекта для расчета ячейки на основании данных формы
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - 
// Возвращаемое значение:
// 	см. БюджетнаяОтчетностьКлиентСервер.СтруктураОбъектаДляРасчетаЯчейки
Функция СтруктураПоОбъектуЭкземпляраБюджета(Форма) Экспорт
	
	ОбъектИПараметрыРасчета = СтруктураОбъектаДляРасчетаЯчейки();
	ОбъектИПараметрыРасчета.Объект = Форма.Объект;
	ОбъектИПараметрыРасчета.ВалютаСценария = Форма.ВалютаСценария;
	ОбъектИПараметрыРасчета.КэшПараметровСтатей = Форма.КэшПараметровСтатей;
	ОбъектИПараметрыРасчета.ТребоватьУказанияКурсовДляКаждогоПериода = Форма.ТребоватьУказанияКурсовДляКаждогоПериода;
	ОбъектИПараметрыРасчета.АдресТаблицыКурсов = Форма.АдресТаблицыКурсов;
	ОбъектИПараметрыРасчета.ПараметрыВыводаВидаБюджета = Форма.ПараметрыВыводаВидаБюджета;
	ОбъектИПараметрыРасчета.АдресДанныхРасшифровки = Форма.АдресДанныхРасшифровки;
	
	Возврат ОбъектИПараметрыРасчета;
	
КонецФункции

Функция ПараметрыПериода(Объект, ПараметрыДанных = Неопределено) Экспорт
	
	Если ПараметрыДанных = Неопределено Тогда
		ПараметрыДанных = Новый Структура;
	КонецЕсли;
	
	ПараметрыДанных.Вставить("НачалоПериода", Объект.НачалоПериода);
	ПараметрыДанных.Вставить("КонецПериода", Объект.ОкончаниеПериода);
	ПараметрыДанных.Вставить("ГраницаФактДанных", Объект.ГраницаФактДанных);
	
	Возврат ПараметрыДанных;
	
КонецФункции

#КонецОбласти


#КонецОбласти
